
angular.module('myApp')

.controller('eventsCtrl', function($scope){

	// $scope.message = 'Everyone come and see how good I look!';


	$scope.newsItems = [
		{
    		date: '17 вересня', 
    		year: '2016 р.',
    		title: 'Ліга Парі-Матч "Карпати" - "Чорноморець"',
    		location: 'м. Львів, стадіон "Арена Львів"',
    		description1: 'Вперше, львівські черлідери виступали та вболівали за футбольний клуб "Карпати"!', 
    		description2: '',
            description3: '',
            description4: '',
    		src: 'img/news/arena17.09.jpg',
    	},


		{
    		date: '5 серпня', 
    		year: '2016 р.',
    		title: 'Урочиста церемонія підняття Державного Прапора України',
    		location: 'м. Львів',
    		description1: 'З нагоди відкриття Ігор ХХХІ Олімпіади в Ріо-де-Жанейро 5 серпня 2016 року о 13 годині біля флагштоку на площі перед Львівською обласною радою та Львівської обласною державною адміністрацією відбулась урочиста церемонія підняття Державного Прапора України та прапору Національного олімпійського комітету України.', 
    		description2: 'Наші спортсменки також взяли участь в церемонії.',
            description3: 'Бажаємо успіху нашим олімпійцям!',
            description4: '',
    		src: 'img/news/rio2016.jpg',
    	},
		{
    		date: '25-26 червня', 
    		year: '2016 р.',
    		title: 'Майстер клас з черліденгу',
    		location: 'м. Львів, ТЦ Forum Lviv',
    		description1: 'Любите активний відпочинок і запальні танці?', 
    		description2: 'Запрошуємо цих вихідних на шоу майстер-класи з черлідингу!',
            description3: 'На вас чекають мега-круті виступи від Львівського обласного осередку Всеукраїнської федерації черлідингу груп підтримки спортивних команд, спортивно-танцювального колективу Lviv Angels!',
            description4: 'Виступи та майстер-класи відбуватимуться 25, 26 червня на головній площі ТЦ Forum Lviv! Початок о 12:00 та 14:00.',
    		src: 'img/news/forum2016.jpg',
    	},
    	{
    		date: '14-15 травня', 
    		year: '2016 р.',
    		title: 'Чемпіонат України серед кадетів та Всеукраїнський турнір "Весна янголів"',
    		location: 'м. Львів, вул. Генерала Грекова, 1',
    		description1: 'Змагання пройдуть на навчально-спортивній базі літніх видів спорту Міноборони України (м. Львів, вул. Ген. Грекова, 1).', 
    		description2: 'Організатори змагань – Мінмолодьспорту України, Всеукраїнська федерація черлідингу, Львівський обласний осередок Всеукраїнської федерації черглідингу, управління фізичної культури та спорту Львівської обласної державної адміністрації.',
            description3: 'Чемпіонат України з черлідингу серед кадетів триватиме від 8.15 до 14.00 год. Головний суддя – Андрієнко Анна (Київ). Очікується участь біля 150 спортсменів.',
            description4: 'Всеукраїнський турнір "Весна янголів" триватиме з 15.00 до 20.30 год. Головний суддя – Залогіна Тетяна (Дніпродзержинськ). Очікується участь біля 270 спортсменів.',
    		src: 'img/angels-spring2016.jpg',
    	},
    	{
    		date: '4-6 березня', 
    		year: '2016 р.',
    		title: 'Чемпіонат України',
    		location: 'м. Дніпродзержинськ',
    		description1: '4-6 березня відбувся Чеміонат України. Спортсмени Львівської області ...', 
    		description2: 'Категорія 5-8: номінація "чер-данс-джаз дует": 2 місце - Гродзіцька Єлизавета та Ковалевець Каміла; 3 місце - Кіш Юлія та Семочко Тетяна.',
            description3: 'Категорія 8-12 років чер-данс-джаз дует - 1 місце Вусатюк Вікторія та Гребінка Емма; 2 місце - Огнива Вікторія та Ігельська Еліна; чер-данс-джаз квартет: 2 місце - Вусатюк Вікторія, Гребінка Емма, Ігельська Еліна, Огнива Вікторія.',
            description4: 'Дорослі, в категорії "чер-данс-фрістайл квартет": 2 місце - Кирелейза Яна, Даценко Анастасія , Дорош Яна, Подлєсна Софія.',
    		src: 'img/leadership2016.jpg',
    	},
    	{
    		date: '27-28 лютого', 
    		year: '2015 р.',
    		title: 'ECU семінар',
    		location: 'м. Відень',
    		description1: '27-28 лютого у Відні відбувся семінар "ECU Rules Conference 2016", в якому взяла участь президент Львівської федерації - Наталія Блажко. Проводила семінар ...', 
    		description2: '',
            description3: '',
            description4: '',
    		src: 'img/news-open1.jpg',
    	}
    ]


});